# CASO DE ESTUDIO 1
*Case of study 1*

## Data fetching

### Gastos

In [51]:
import pandas as pd

gastos = pd.read_csv('CasoMarketing-Gasto.csv')
gastos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48 entries, 0 to 47
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Semana          48 non-null     int64
 1   GastoAdwords    48 non-null     object
 2   GastoFacebook   48 non-null     object
 3   GastoInstagram  48 non-null     object
 4   GastoOrganico   48 non-null     object
dtypes: int64(1), object(4)
memory usage: 2.0+ KB

| **Column name** | **Feature description** |
|----------------:| :---------------------: |
| *Semana*        | Week of the data |
| *GastoAdwords*  | Google advertisement cost |
| *GastoFacebook* | Facebook avertisement cost |
| *GastoInstagram*| Intsgram advertisement cost |
| *GastoOrganico* | Company's page cost |

The table must be cleaned and processed.

In [52]:
gastos.head()

   Semana GastoAdwords GastoFacebook GastoInstagram GastoOrganico
0       1  $58,587.80    $13,166.12     $25,644.37         $0.00
1       2  $67,295.35    $15,130.57     $25,603.19         $0.00
2       3  $43,330.19    $14,983.00     $28,962.36         $0.00
3       4  $60,818.66    $14,294.78     $29,601.45         $0.00
4       5  $43,593.73    $18,685.01     $29,219.29         $0.00

In [53]:
gastos.set_index('Semana', inplace=True)
gastos.drop('GastoOrganico', axis=1, inplace=True) # description specifies it is always 0

to_float = lambda x: x.replace('$', '')

gastos.applymap(to_float)
    
gastos.head()

       GastoAdwords GastoFacebook GastoInstagram
Semana
1       $58,587.80    $13,166.12     $25,644.37
2       $67,295.35    $15,130.57     $25,603.19
3       $43,330.19    $14,983.00     $28,962.36
4       $60,818.66    $14,294.78     $29,601.45
5       $43,593.73    $18,685.01     $29,219.29